In [2]:
import pandas as pd

In [2]:
series = pd.Series([1, 2, 3])
series * 2
print(series)
series = pd.Series(['foo', 'bar'])
series[0]
months = ['jan', 'feb', 'mar', 'apr']
sales = [100, 200, 300, 400]
data = pd.Series(data=sales, index=months)
data
months = ['jan', 'feb', 'mar', 'apr']
sales = {
    'revenue':     [100, 200, 300, 400],
    'items_sold':  [23, 43, 55, 65],
    'new_clients': [10, 20, 30, 40]
}
sales_df = pd.DataFrame(data=sales, index=months)
sales_df

0    1
1    2
2    3
dtype: int64

     revenue  items_sold  new_clients
jan      100          23           10
feb      200          43           20
mar      300          55           30
apr      400          65           40

In [3]:
orders = pd.read_csv('D:/maga_1/ML/data/external/orders.csv', index_col='id')
print(orders.shape)
print(orders.columns)
print(orders.dtypes)
print(orders.index)
orders.describe()
orders.head()

(5009, 4)
Index(['order_date', 'ship_mode', 'customer_id', 'sales'], dtype='object')
order_date      object
ship_mode       object
customer_id     object
sales          float64
dtype: object
Index([100006, 100090, 100293, 100328, 100363, 100391, 100678, 100706, 100762,
       100860,
       ...
       167570, 167920, 168116, 168613, 168690, 168802, 169320, 169488, 169502,
       169551],
      dtype='int64', name='id', length=5009)

        order_date ship_mode customer_id    sales
id
100006  2014-09-07  Standard    DK-13375  377.970
100090  2014-07-08  Standard    EB-13705  699.192
100293  2014-03-14  Standard    NF-18475   91.056
100328  2014-01-28  Standard    JC-15340    3.928
100363  2014-04-08  Standard    JM-15655   21.376

In [30]:
print(orders['sales'])
print(orders[['customer_id', 'sales']])
show_these_orders = [1, 2, 3]
orders.iloc[show_these_orders]
#columns = ['customer_id', 'sales']
#rows = ["100363", "100371", "100706"]
#orders.loc[rows][columns]

id
100006     377.970
100090     699.192
100293      91.056
100328       3.928
100363      21.376
            ...
168802      18.368
169320     171.430
169488      56.860
169502     113.410
169551    1344.838
Name: sales, Length: 5009, dtype: float64
       customer_id     sales
id
100006    DK-13375   377.970
100090    EB-13705   699.192
100293    NF-18475    91.056
100328    JC-15340     3.928
100363    JM-15655    21.376
...            ...       ...
168802    JO-15145    18.368
169320    LH-16900   171.430
169488    AA-10375    56.860
169502    MG-17650   113.410
169551    RL-19615  1344.838

[5009 rows x 2 columns]

        order_date ship_mode customer_id    sales
id
100090  2014-07-08  Standard    EB-13705  699.192
100293  2014-03-14  Standard    NF-18475   91.056
100328  2014-01-28  Standard    JC-15340    3.928

In [32]:
filter_large = orders['sales'] > 1000
orders.loc[filter_large]

        order_date ship_mode customer_id     sales
id
101931  2014-10-28     First    TS-21370  1252.602
102673  2014-11-01  Standard    KH-16630  1044.440
102988  2014-04-05    Second    GM-14695  4251.920
103100  2014-12-20     First    AB-10105  1107.660
103310  2014-05-10  Standard    GM-14680  1769.784
...            ...       ...         ...       ...
167318  2017-07-26  Standard    GZ-14545  2012.302
167402  2017-01-13    Second    CP-12085  4619.330
167920  2017-12-09    Second    JL-15835  1827.510
168116  2017-11-04  Same Day    GT-14635  8167.420
169551  2017-07-07     First    RL-19615  1344.838

[620 rows x 4 columns]

In [34]:
filter_large = orders['sales'] > 1000
filter_first_class = orders['ship_mode'] == 'First'
orders.loc[filter_large & filter_first_class]

        order_date ship_mode customer_id     sales
id
101931  2014-10-28     First    TS-21370  1252.602
103100  2014-12-20     First    AB-10105  1107.660
106726  2014-12-06     First    RS-19765  1261.330
112158  2014-12-02     First    DP-13165  1050.600
116666  2014-05-08     First    KT-16480  1799.970
...            ...       ...         ...       ...
147886  2017-03-28     First    DH-13075  1435.960
155425  2017-11-10     First    AB-10600  1475.054
162558  2017-10-02     First    Dp-13240  2437.672
165456  2017-11-30     First    TB-21625  1079.316
169551  2017-07-07     First    RL-19615  1344.838

[96 rows x 4 columns]

In [37]:
orders.query('sales > 1000 & ship_mode == "First"')
sales_filter = 1000
ship_mode_filter = 'First'
orders.query('sales > @sales_filter & ship_mode > @ship_mode_filter')

        order_date ship_mode customer_id     sales
id
102673  2014-11-01  Standard    KH-16630  1044.440
102988  2014-04-05    Second    GM-14695  4251.920
103310  2014-05-10  Standard    GM-14680  1769.784
103492  2014-10-10  Standard    CM-12715  1488.774
103660  2014-08-25  Standard    MW-18220  1007.944
...            ...       ...         ...       ...
166688  2017-05-20  Standard    RD-19480  1196.316
167318  2017-07-26  Standard    GZ-14545  2012.302
167402  2017-01-13    Second    CP-12085  4619.330
167920  2017-12-09    Second    JL-15835  1827.510
168116  2017-11-04  Same Day    GT-14635  8167.420

[524 rows x 4 columns]

In [42]:
print(orders['sales'].sum())
print(orders.groupby('ship_mode')['sales'].sum())
pd.options.display.float_format = '{:,.1f}'.format
orders.groupby('ship_mode')['sales'].sum()
orders.groupby(['ship_mode', 'order_date'])['sales'].sum()
orders.groupby(['ship_mode', 'order_date'])['sales'].agg(['sum', 'count'])
orders.groupby(['ship_mode', 'order_date'])['sales'].agg(['sum']).sort_values(by='sum', ascending=False).head(10)

2297200.8603000003
ship_mode
First        351,428.4
Same Day     128,363.1
Second       459,193.6
Standard   1,358,215.7
Name: sales, dtype: float64

                          sum
ship_mode order_date
Standard  2014-03-18 26,908.4
          2016-10-02 18,398.2
First     2017-03-23 14,299.1
Standard  2014-09-08 14,060.4
First     2017-10-22 13,716.5
Standard  2016-12-17 12,185.1
          2017-11-17 12,112.5
          2015-09-17 11,467.6
          2016-05-23 10,561.0
          2014-09-23 10,478.6

In [45]:
customers = pd.read_csv('D:/maga_1/ML/data/external/customers.csv', index_col ='id')
print(customers.head())
cust_filter = 'CG-12520'
orders.query('customer_id == @cust_filter')
new_df = pd.merge(orders, customers, how='inner', left_on='customer_id', right_index=True)
new_df.columns

                     name    segment           state             city
id
CG-12520      Claire Gute   Consumer        Kentucky        Henderson
DV-13045  Darrin Van Huff  Corporate      California      Los Angeles
SO-20335   Sean O'Donnell   Consumer         Florida  Fort Lauderdale
BH-11710  Brosina Hoffman   Consumer      California      Los Angeles
AA-10480     Andrew Allen   Consumer  North Carolina          Concord

Index(['order_date', 'ship_mode', 'customer_id', 'sales', 'name', 'segment',
       'state', 'city'],
      dtype='object')

In [61]:
orders_2016 = orders.query("order_date >= '2016-01-01' & order_date <= '2016-12-31'")
print(orders_2016.head())
with_customers_2016 = pd.merge(customers, orders_2016, how='inner', left_index=True, right_on='customer_id')
grouped_2016 = with_customers_2016.groupby('city')['sales'].sum()
print(grouped_2016.head())
top5 = grouped_2016.sort_values(ascending=False).head(5)
print(top5)

        order_date ship_mode customer_id   sales
id
100041  2016-11-20  Standard    BF-10975   328.5
100083  2016-11-24  Standard    CD-11980    24.8
100153  2016-12-13  Standard    KH-16630    63.9
100244  2016-09-20  Standard    GM-14695   475.7
100300  2016-06-24    Second    MJ-17740 4,823.1
city
Akron               1,763.0
Albuquerque           692.9
Amarillo              197.2
Arlington           5,672.1
Arlington Heights      14.1
Name: sales, dtype: float64
city
New York City   53,094.1
Philadelphia    39,895.5
Seattle         33,955.5
Los Angeles     33,611.1
San Francisco   27,990.0
Name: sales, dtype: float64

*Сколько заказов, отправлено первым классом за последние 5 лет?*

In [59]:
date_start = '2015-10-19' #за последние 5 лет - 0, поэтому поставил дату пораньше
orders.query("order_date >= @date_start  & ship_mode == 'First'").count()

order_date     548
ship_mode      548
customer_id    548
sales          548
dtype: int64

*Сколько в базе клиентов из Калифорнии?*

In [63]:
#orders_for_cust = pd.merge(orders, customers, how='inner', left_index=True, right_on='customer_id')
customers.query("state == 'California'").count()

name       161
segment    161
state      161
city       161
dtype: int64

*Сколько заказов они сделали?*

In [65]:
calforn_cust = customers.query("state == 'California'")
orders_for_cust = pd.merge(orders, calforn_cust, how='inner', left_on = 'customer_id', right_on = 'id')
count = orders_for_cust.count()
print(count)

order_date     1006
ship_mode      1006
customer_id    1006
sales          1006
name           1006
segment        1006
state          1006
city           1006
dtype: int64

*Постройте сводную таблицу средних чеков по всем штатам за каждый год.*

In [83]:
orders_for_cust = pd.merge(orders, customers, how='inner', left_on = 'customer_id', right_on = 'id')
grouped_orders = orders_for_cust.groupby(['state', pd.to_datetime(orders_for_cust['order_date'], yearfirst=True).dt.year])['sales'].agg('mean')
#grouped_orders = orders_for_cust.groupby(['state', orders_for_cust['order_date'].str[:4]])['sales'].agg('mean')
print(grouped_orders)

state       order_date
Alabama     2014         425.5
            2015         501.4
            2016         854.3
            2017         418.0
Arizona     2014         475.2
                          ...
Washington  2017         576.4
Wisconsin   2014         318.1
            2015         831.2
            2016         444.5
            2017         797.5
Name: sales, Length: 161, dtype: float64

*ТОП N товаров*

In [98]:
top_n = 5
transactions = pd.read_csv('D:/maga_1/ML/data/external/transactions_diy.csv', index_col=False)
grouped = transactions.groupby(transactions['Item'])[['Quantity', 'Amount']].agg('sum')
#print(grouped)
grouped_df = grouped.sort_values(by = ['Amount'], ascending=False).head(top_n)
print(grouped_df)

          Quantity   Amount
Item
sku26161     18902  5373638
sku18199      7250  3951361
sku21947     15304  3918570
sku28128      7705  3027786
sku8342       3512  2113158

In [ ]:
transactions = pd.read_csv('D:/maga_1/ML/data/external/transactions_diy.csv', index_col=False)